openfoam9/tutorials/incompressible/simpleFoam/drivaerFastback/system/controlDict.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1000;

deltaT          1;

writeControl    timeStep;

writeInterval   250;

purgeWrite      0;

writeFormat     binary;

writePrecision   8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

// adjustTimeStep  yes;

// maxCo           1;

functions
{
    #includeFunc forceCoeffsIncompressible

    #includeFunc time

    #includeFunc streamlinesSphere
    (
        funcName=streamlines,
        centre=(4 0 0.7),
        radius=1,
        nPoints=30,
        fields=(U)
    )

    #includeFunc cutPlaneSurface
    (
        funcName=xNormal,
        point=(4 0 1),
        normal=(1 0 0),
        fields=(p U)
    )

    #includeFunc cutPlaneSurface
    (
        funcName=yNormal,
        point=(-5 0.02 1),
        normal=(0 1 0),
        fields=(p U)
    )

    #includeFunc patchSurface(funcName=car, patch=".*(body|Wheels)", p)
}

// ************************************************************************* //
